literate/core.org
#+title: Core defaults and helpers
#+property: header-args:emacs-lisp :tangle ../modules/gtk-core.el :results silent

* Header
#+begin_src emacs-lisp
;;; gtk-core.el --- core defaults and helpers  -*- lexical-binding: t; -*-
;;; Commentary:
;; Built-in settings and pure helpers. No external packages, no use-package,
;; so this file loads standalone (and is unit-testable in -q --batch).
;;; Code:
#+end_src

* Path helpers
#+begin_src emacs-lisp
(defun gtk/emacs-path (path)
  "Expand PATH relative to `user-emacs-directory'."
  (expand-file-name path user-emacs-directory))
#+end_src

* Identity
#+begin_src emacs-lisp
(setq user-full-name "Greg Tucker-Kellogg"
      user-mail-address "dbsgtk@nus.edu.sg")
#+end_src

* Sane defaults
#+begin_src emacs-lisp
(set-language-environment "UTF-8")
(prefer-coding-system 'utf-8)
(setq sentence-end-double-space nil
      visible-bell t
      inhibit-startup-message t
      require-final-newline t)
(setq-default fill-column 110
              indent-tabs-mode nil)
(menu-bar-mode 1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(tooltip-mode -1)
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
(setq scroll-conservatively 10000 auto-window-vscroll nil)
(setq diff-switches "-u")
#+end_src

* Backups, autosave, recent files, places, history
#+begin_src emacs-lisp
(let ((backup-dir (gtk/emacs-path "backups/"))
      (auto-dir   (gtk/emacs-path "auto-save/")))
  (make-directory backup-dir t)
  (make-directory auto-dir t)
  (setq backup-directory-alist `(("." . ,backup-dir))
        auto-save-file-name-transforms `((".*" ,auto-dir t))
        backup-by-copying t
        delete-old-versions t
        version-control t))
(add-to-list 'completion-ignored-extensions ".los")
(recentf-mode 1)
(global-set-key (kbd "C-x f") #'recentf-open)
(save-place-mode 1)
(savehist-mode 1)
#+end_src

* Server (interactive sessions only)
#+begin_src emacs-lisp
(unless noninteractive
  (require 'server)
  (unless (server-running-p) (server-start)))
#+end_src

* Remote editing (tramp)
#+begin_src emacs-lisp
;; Edit remote files as root by hopping through ssh first
;; (e.g. /sudo:host:/etc/... connects via /ssh:host: then sudo).
(with-eval-after-load 'tramp
  (setq tramp-default-proxies-alist '((".*" "\\`root\\'" "/ssh:%h:"))))
#+end_src

* Disabled-command unlocks
#+begin_src emacs-lisp
(put 'narrow-to-region 'disabled nil)
(put 'set-goal-column 'disabled nil)
(put 'dired-find-alternate-file 'disabled nil)
#+end_src

* Footer
#+begin_src emacs-lisp
(provide 'gtk-core)
;;; gtk-core.el ends here
#+end_src

# Local Variables:
# eval: (add-hook 'after-save-hook #'org-babel-tangle nil t)
# End:
